Merge pull request #24 from tiernaco1/frontend-improvements
Merge Frontend improvements into Sanitise
